Tekla Open API Reference for Tekla Structures 2025
Dialogs.OpenDialogAndGet Method
 Opens a dialog and forces it to get the values from the currently selected part.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int OpenDialogAndGet(
	string param
)
Public Shared Function OpenDialogAndGet (
	param As String
) As Integer
Parameters
param
Type: System.String
Not used.
Return Value
Type: Int32
0 always.
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace